src/Documents/СписаниеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СписаниеТоваров</Name>
			<Comment>Списание товаров</Comment>
			<BasedOn>
				<xr:Item>Document.РасходныйСкладскойОрдер</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ВводОстатковТоваров</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ГТДПартийТоваровКомпании</xr:Item>
				<xr:Item>InformationRegister.ДопроведениеПоПартиям</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
				<xr:Item>AccumulationRegister.РеализованныеТовары</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровОтданные</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Комиссионер, которому мы передали товары на комиссию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор, по которому ведутся взаиморасчеты с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании, на котором происходит списание</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип розничных цен списания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеЗатрат</Name>
					<Comment>Подразделение компании, на которое списываются затраты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяСписанияТМЦ</Name>
					<Comment>Статья списания ТМЦ на расходы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.итЗаявкаНаВозврат</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйСкладскойОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ит_ЗаявкаНаОбмен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаВозврата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ит_ПричиныВозвратаПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаявки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>итСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.итСостоянияВыполненияПеремещенийТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>итЗаявкаНаВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Списываемые товары</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПередачи</Name>
							<Comment>Документ передачи товаров на комиссию</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Comment>Партия, с которой будет списан товар</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГТД</Name>
							<Comment>Номер грузовой таможенной декларации (для товаров поступивших по импорту)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРозничная</Name>
							<Comment>Розничная цена для переоценки остатков перед списанием</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРозничная</Name>
							<Comment>Розничная сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Comment>Ячейка хранения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяСписанияТМЦ</Name>
							<Comment>Статья списания ТМЦ на расходы</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>итОтветственныйЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОтветственного</Name>
							<Type>
								<v8:Type>cfg:EnumRef.итВидыОтветвенныхИнвентаризация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<Comment>Заказы покупателей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Comment>Количество номенклатуры по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество номенклатуры, зарезервированной на складе для этого заказа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервСвободный</Name>
					<Comment>Количество номенклатуры, зарезервированной на складе для этого заказа из свободного остатка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма заказанной номенклатуры в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма заказанной номенклатуры в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРег</Name>
					<Comment>Сумма заказанной номенклатуры рег.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции с заказом (заказ, резервирование...)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗамены</Name>
					<Comment>Идентификатор операции замены заказанного товара на другой</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент, разместивший заказ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Comment>Документ оформления заказа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании, на котором был зарезервирован товар для этого заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ДопроведениеПоПартиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДопроведениеПоПартиям</Name>
			<Comment>Список документов которые необходимо допровести по партиям</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыПартий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыПартий</Name>
			<Comment>Статусы партий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварКупленный</Name>
					<Comment>Товар (купленный)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварПринятыйКомиссия</Name>
					<Comment>Товар (принятый на комиссию)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/СписаниеТоваров/Ext/ObjectModule.bsl
// Модуль документа "Списание товаров"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании справочника "Контрагенты"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Контрагенты(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Заполняем специфические для данной операции реквизиты
	ХозОперация = Справочники.ХозОперации.СписаниеТоваровОтданныхНаКомиссию;
	Документы.СписаниеТоваров.ХозОперацияПриИзменении(ЭтотОбъект, ДополнительныеСвойства.ПараметрыДействия);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Контрагенты()

// Производит заполнение объекта на основании документа "Поступление товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПоступлениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.УслугиСтороннихОрганизаций Тогда 	
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ввод документа ""Списание товаров"" на основании документа ""Поступление товаров"" с хоз.операцией <%1> запрещен.'"), ДанныеЗаполнения.ХозОперация);
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, ТекстСообщения);
		Возврат ЛОЖЬ;
	КонецЕсли;

	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров 
		ИЛИ ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваровКомиссия 
		ИЛИ ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ПоступлениеБезвозмездное 
		ИЛИ ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ВводОстатковТоваров
		ИЛИ ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ВводОстатковТоваровПринятыхНаКомиссию Тогда
		
		ХозОперация = Справочники.ХозОперации.СписаниеТоваров;
		Документы.СписаниеТоваров.ЗаполнитьТоварыОстатками(ЭтотОбъект, ДанныеЗаполнения);
		
	ИначеЕсли ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ВводОстатковТоваровПереданныхНаКомиссию Тогда
		
		ХозОперация = Справочники.ХозОперации.СписаниеТоваровОтданныхНаКомиссию;
		Документы.СписаниеТоваров.ЗаполнитьТоварыОстатками(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПоступлениеТоваров()

// Производит заполнение объекта на основании документа "Заказ покупателя"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ЗаказПокупателя(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если НЕ (ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ЗаказРезервированиеПокупателя ИЛИ ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.РезервированиеПокупателя) Тогда 	
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ввод документа ""Списание товаров"" на основании документа ""Заказ покупателя"" с хоз.операцией <%1> запрещен.'"), ДанныеЗаполнения.ХозОперация);
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, ТекстСообщения);
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	ЭтотОбъект.Товары.Очистить();
	
	Запрос =Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПокупателейОстатки.РезервОстаток КАК Количество,
	|	ЗаказыПокупателейОстатки.Заказ КАК Заказ,
	|	ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	|	ЗаказыПокупателейОстатки.Номенклатура.Артикул КАК Артикул,
	|	ЗаказыПокупателейОстатки.Номенклатура.Код КАК Код
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(&МоментВремени, Заказ = &Заказ) КАК ЗаказыПокупателейОстатки
	|ГДЕ
	|	ЗаказыПокупателейОстатки.РезервОстаток > 0";
	
	Запрос.УстановитьПараметр("Заказ", ДанныеЗаполнения.Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	Выборка = Запрос.Выполнить();
	Если Выборка.Пустой() Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Нет резервов по Заказу <%1>'"), ДанныеЗаполнения.Ссылка);
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, ТекстСообщения);
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	ВыборкаЗаказа = Выборка.Выбрать();
	Пока ВыборкаЗаказа.Следующий() Цикл
		НоваяСтрока = ЭтотОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗаказа);
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПоступлениеТоваров()



// Производит заполнение объекта на основании документа "Ввод остатков товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ВводОстатковТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ВводОстатковТоваровПринятыхИПроданных Тогда 	
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ввод документа ""Списание товаров"" на основании документа ""Ввод остатков товаров"" с хоз.операцией <%1> запрещен.'"), ДанныеЗаполнения.ХозОперация);
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, ТекстСообщения);
		Возврат ЛОЖЬ;
	КонецЕсли;

	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров 
		ИЛИ ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваровКомиссия 
		ИЛИ ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ПоступлениеБезвозмездное 
		ИЛИ ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ВводОстатковТоваров
		ИЛИ ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ВводОстатковТоваровПринятыхНаКомиссию Тогда
		
		ХозОперация = Справочники.ХозОперации.СписаниеТоваров;
		Документы.СписаниеТоваров.ЗаполнитьТоварыОстатками(ЭтотОбъект, ДанныеЗаполнения);
		
	ИначеЕсли ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ВводОстатковТоваровПереданныхНаКомиссию Тогда
		
		ХозОперация = Справочники.ХозОперации.СписаниеТоваровОтданныхНаКомиссию;
		Документы.СписаниеТоваров.ЗаполнитьТоварыОстатками(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ВводОстатковТоваров()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

// У нас не стандартная таблица, поэтому сформирует свой результат запроса по товарам.
//
// Параметры:
//  ШапкаДокумента - выборка.
//
Функция ПолучитьРезультатЗапросаПоТоварам(ШапкаДокумента)
    ТекстЗапроса="ВЫБРАТЬ РАЗРЕШЕННЫЕ
                 |	СписаниеТоваровТовары.Номенклатура КАК Номенклатура,
                 |	СписаниеТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
                 |	СписаниеТоваровТовары.ДокументПередачи КАК ДокументПередачи,
                 |	СписаниеТоваровТовары.Партия КАК Партия,
                 |	СписаниеТоваровТовары.ГТД КАК ГТД,
                 |	СписаниеТоваровТовары.ЦенаРозничная КАК ЦенаРозничная,
                 |	СписаниеТоваровТовары.Количество * СписаниеТоваровТовары.Коэффициент КАК Количество
                 |ИЗ
                 |	Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
                 |ГДЕ
                 |	СписаниеТоваровТовары.Ссылка = &Ссылка";

	Запрос=Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",ШапкаДокумента.Ссылка);
	Запрос.Текст=ТекстЗапроса;

	Возврат Запрос.Выполнить();
КонецФункции // ПолучитьРезультатЗапросаПоТоварам()

Функция ПолучитьРезультатЗаказам(ШапкаДокумента)
    ТекстЗапроса="ВЫБРАТЬ РАЗРЕШЕННЫЕ
                 |	СписаниеТоваровТовары.Номенклатура КАК Номенклатура,
                 |	СписаниеТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
                 |	СписаниеТоваровТовары.ДокументПередачи КАК ДокументПередачи,
                 |	СписаниеТоваровТовары.Партия КАК Партия,
                 |	СписаниеТоваровТовары.ГТД КАК ГТД,
                 |	СписаниеТоваровТовары.ЦенаРозничная КАК ЦенаРозничная,
                 |	СписаниеТоваровТовары.Количество * СписаниеТоваровТовары.Коэффициент КАК Резерв,
                 |	СписаниеТоваровТовары.Ссылка.ДокументОснование КАК Заказ,
                 |	0 КАК Количество
                 |ИЗ
                 |	Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
                 |ГДЕ
                 |	СписаниеТоваровТовары.Ссылка = &Ссылка";

	Запрос=Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",ШапкаДокумента.Ссылка);
	Запрос.Текст=ТекстЗапроса;

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьРезультатЗаказам()

// возвращает выборку по шапке
//
// Параметры:
//  ДокументСсылка - Ссылка на документ для которого получаем шапку.
//
// Возвращаемое значение:
//  Выборка - выборка по шапке
//
Функция ПолучитьШапкуДокумента(ДокументСсылка) Экспорт
	Запрос=Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка          КАК Ссылка,
	|	Док.Дата            КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента   КАК КурсДокумента,
	|	Док.ТипЦен          КАК ТипЦен,
	|	Док.ХозОперация     КАК ХозОперация,
	|	Док.КурсВалютыУпр   КАК КурсВалютыУпр,
	|	Док.МоментВремени   КАК МоментВремени,
	|	Док.Организация     КАК Организация,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	Док.Проект КАК Проект,
	/////////// ПРИВАТ ////////////
	|	Док.СкладКомпании               КАК СкладКомпании,
	|	Док.СкладКомпании.ПодразделениеКомпании КАК ПодразделениеСклада,	
	|	Док.ПодразделениеЗатрат			КАК ПодразделениеЗатрат,	
	|	Док.Контрагент                  КАК Контрагент,
	|	Док.ДоговорВзаиморасчетов       КАК ДоговорВзаиморасчетов,
	|	Док.ДоговорВзаиморасчетов.ПодразделениеКомпании КАК ПодразделениеДоговора, 
	|	Док.ДокументОснование           КАК ДокументОснование,
	|	Док.СтатьяСписанияТМЦ           КАК СтатьяСписанияТМЦ
	|
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции // ПолучитьШапкуДокумента()

// формирует движения документа по партионным регистрам
//
// Параметры:
//  Режим           - режим проведения (оперативный/неоперативный)
//  ДокументСсылка  - ссылка на документ который надо допровести по партиям.
//
// Возвращаемое значение:
//  Возвращает Истина - все ОК, ложь - чего-то не так.
//
Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	Отказ=Ложь;
	
	// получим шапку документа
	ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	
	// определим способ ведения баланса
	ВедетсяБалансПоПодразделению = БалансВедетсяПоПодразделениям(ШапкаДокумента.Дата);
	
	// Проверим, если подразделение проводиться по партиям "отложенно", то дальше не идем.
	НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		Возврат НЕ Отказ;
	КонецЕсли;
	
	// У нас не стандартная таблица, поэтому сформирует свой результат запроса по товарам.
	РезультатЗапросаПоТоварам=ПолучитьРезультатЗапросаПоТоварам(ШапкаДокумента);
	// определим вид проводки
	Если ШапкаДокумента.ХозОперация=Справочники.ХозОперации.СписаниеТоваров
		ИЛИ ШапкаДокумента.ХозОперация=Справочники.ХозОперации.СписаниеВПроизводство Тогда
		// списываем
		НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
		НаборЗаписейПартии.ДокументОбъект       = ЭтотОбъект;
		НаборЗаписейПартии.СкладКомпании        = ШапкаДокумента.СкладКомпании;
		НаборЗаписейПартии.Организация          = ШапкаДокумента.Организация;
		НаборЗаписейПартии.ИмяРеквизитаДокумент = ?(ПравоПользователя("ВыборочноеСписаниеПартий",ЭтотОбъект),"Партия","");
		НаборЗаписейПартии.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
		НаборЗаписейПартии.ШапкаДокумента            = ШапкаДокумента;
		Отказ=НЕ НаборЗаписейПартии.Расход() ИЛИ Отказ;
		Если НЕ Отказ Тогда НаборЗаписейПартии.Записать(); КонецЕсли; 
		
		// Доходы и расходы. Только по собственному товару.
		СуммаУпрИтого   = 0;
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("СтатусПартии", Перечисления.СтатусыПартий.ТоварКупленный);
		МассивСтрок = НаборЗаписейПартии.Выгрузить().НайтиСтроки(СтруктураПоиска);
		Для каждого ТекСтрока Из МассивСтрок Цикл  	
			СуммаУпрИтого = СуммаУпрИтого + ТекСтрока.СуммаУпр;
		КонецЦикла;
		
		Если СуммаУпрИтого<>0 Тогда
			НаборЗаписейДиР 			   = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
			Если ВедетсяБалансПоПодразделению Тогда
				НаборЗаписейДиР.Подразделение = ШапкаДокумента.ПодразделениеСклада;
			Иначе 
				НаборЗаписейДиР.Подразделение = ШапкаДокумента.ПодразделениеЗатрат;
			КонецЕсли;
			//Если ЗначениеЗаполнено(ТекСтрока.СтатьяСписанияТМЦ) Тогда
			//	НаборЗаписейДиР.СтатьяДоходовИРасходов	= ТекСтрока.СтатьяСписанияТМЦ;
			//Иначе
				НаборЗаписейДиР.СтатьяДоходовИРасходов	= ШапкаДокумента.СтатьяСписанияТМЦ;
			//КонецЕсли;
			НаборЗаписейДиР.ВУпрВалюте				= Истина;
			НаборЗаписейДиР.Расход					= СуммаУпрИтого;
			НаборЗаписейДиР.ШапкаДокумента			= ШапкаДокумента;
			Отказ=НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
		
		// Зачитываем принятые на реализацию товары, которые были списаны
		НаборЗаписейРеализованныеТовары=Движения.РеализованныеТовары;
		НаборЗаписейРеализованныеТовары.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейРеализованныеТовары.Списание=Истина;
		НаборЗаписейРеализованныеТовары.РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам;
		НаборЗаписейРеализованныеТовары.ШапкаДокумента=ШапкаДокумента;
		Отказ=НЕ НаборЗаписейРеализованныеТовары.Приход() ИЛИ Отказ;
		
		// подготовим таблицу движений в разрезе подразделений комиссионных товаров
		ТаблицаСписанийПартийРеализованных = Движения.РеализованныеТовары.Выгрузить();
		ТаблицаСписанийПартийРеализованных.Свернуть("ДоговорВзаиморасчетов","СуммаУпр");
		
		ТаблицаСписанийПартийРеализованных.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
		Для Каждого СтрокаСписания Из ТаблицаСписанийПартийРеализованных Цикл
			СтрокаСписания.Подразделение = СтрокаСписания.ДоговорВзаиморасчетов.ПодразделениеКомпании;
		КонецЦикла;	
		ТаблицаСписанийПартийРеализованных.Свернуть("Подразделение","СуммаУпр");
		
		// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
		Если ВедетсяБалансПоПодразделению Тогда
			Для Каждого СтрокаСписания Из ТаблицаСписанийПартийРеализованных Цикл
				НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
				НаборЗаписейДоходыИРасходы.ДокументОбъект = ЭтотОбъект;
				НаборЗаписейДоходыИРасходы.Подразделение  = СтрокаСписания.Подразделение;
				НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Себестоимость;
				НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Истина;
				НаборЗаписейДоходыИРасходы.Расход                 = СтрокаСписания.СуммаУпр;
				НаборЗаписейДоходыИРасходы.ШапкаДокумента         = ШапкаДокумента;
				Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
			КонецЦикла;
		Иначе
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Себестоимость;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Истина;
			НаборЗаписейДоходыИРасходы.Расход                 = ТаблицаСписанийПартийРеализованных.Итог("СуммаУпр");
			НаборЗаписейДоходыИРасходы.ШапкаДокумента         = ШапкаДокумента;
			Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		КонецЕсли;
	Иначе
		// списываем товары отданные на комиссию
		НаборЗаписейПартииОтданные = Движения.ПартииТоваровОтданные;
		НаборЗаписейПартииОтданные.ДокументОбъект = ЭтотОбъект;
		НаборЗаписейПартииОтданные.Контрагент     = ШапкаДокумента.Контрагент;
		НаборЗаписейПартииОтданные.ДоговорВзаиморасчетов     = ШапкаДокумента.ДоговорВзаиморасчетов;
		НаборЗаписейПартииОтданные.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
		НаборЗаписейПартииОтданные.ШапкаДокумента            = ШапкаДокумента;
		Отказ=НЕ НаборЗаписейПартииОтданные.Расход() ИЛИ Отказ;
		Если НЕ Отказ Тогда НаборЗаписейПартииОтданные.Записать(); КонецЕсли; 
		
		// 3. Доходы и расходы
		ТаблицаЗначений = НаборЗаписейПартииОтданные.Выгрузить();
		ТаблицаЗначений.Свернуть("ВидДвижения","СуммаСебестоимостиУпр");
		
		СтрокаТЗ = ТаблицаЗначений.Найти(ВидДвиженияНакопления.Расход,"ВидДвижения");
		Если СтрокаТЗ <> Неопределено Тогда
			НаборЗаписейДиР 						= Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект 			= ЭтотОбъект;
			// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
			Если ВедетсяБалансПоПодразделению Тогда
				НаборЗаписейДиР.Подразделение       = ШапкаДокумента.ПодразделениеДоговора;
			КонецЕсли;
			//Если ЗначениеЗаполнено(СтрокаТЗ.СтатьяСписанияТМЦ) Тогда
			//	НаборЗаписейДиР.СтатьяДоходовИРасходов	= СтрокаТЗ.СтатьяСписанияТМЦ;
			//Иначе
				НаборЗаписейДиР.СтатьяДоходовИРасходов	= ШапкаДокумента.СтатьяСписанияТМЦ;
			//КонецЕсли;
			НаборЗаписейДиР.ВУпрВалюте				= Истина;
			НаборЗаписейДиР.ШапкаДокумента			= ШапкаДокумента;
			НаборЗаписейДиР.Расход					= СтрокаТЗ.СуммаСебестоимостиУпр;
			Отказ=НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли; 
		
	КонецЕсли;
	
	// двигаем границу последовательности партий
	Если Ссылка <> ДокументСсылка Тогда
		
		РаботаСГраницами.МоментВремениПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		РаботаСГраницами.ДвиженияПоПартиямПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		
	КонецЕсли;
	
	РаботаСГраницами.СдвинутьГраницуПартий(ДокументСсылка, ДополнительныеСвойства, Движения);

	// Все ОК
	Возврат НЕ Отказ;
КонецФункции // ПровестиПоПартиям()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения = "", СтандартнаяОбработка=Истина)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьРеквизит(ДанныеЗаполнения, "ХозОперация") Тогда
		
		Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.РасходныйСкладскойОрдер Тогда
			Для Каждого СтрТовар Из Товары Цикл
				Документы.СписаниеТоваров.ТоварыКоличествоПриИзменении(ЭтотОбъект, СтрТовар);
			КонецЦикла;
		КонецЕсли;
		
		Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровИзФилиала И ЕстьРеквизит(ДанныеЗаполнения, "СкладПолучатель") Тогда
			СкладКомпании = ДанныеЗаполнения.СкладПолучатель;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ХозОперация = Справочники.ХозОперации.СписаниеТоваровОтданныхНаКомиссию 
		ИЛИ БалансВедетсяПоПодразделениям(ТекущаяДатаСеанса()) Тогда
		
		ПодразделениеЗатрат	= Справочники.ПодразделенияКомпании.ПустаяСсылка();
	Иначе
		ПодразделениеЗатрат	= ПодразделениеКомпании;
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Мальцев А.Ю. +++	
	Если СтатьяСписанияТМЦ.итКонтрольИспользования И 
			(РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ (Проведен И РежимЗаписи = РежимЗаписиДокумента.Запись) ИЛИ  РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения)
			И РольДоступна("ПолныеПрава")  = Ложь И СтатьяСписанияТМЦ.ПользователиРазрешения.Найти(ПараметрыСеанса.ТекущийПользователь, "Пользователь") = НЕОПРЕДЕЛЕНО Тогда
			Сообщить("Нет прав на проведение документа");
			Отказ = Истина;
	КонецЕсли;
	//Мальцев А.Ю. ---
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Произведем очистку не использующихся в текущем контексте реквизитов
	ОбработкаСобытийДокументаСервер.ОчиститьПолеЦенаРозничнаяДляНеРозничныхСкладов(ЭтотОбъект, СкладКомпании);
	
	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоЗаказамПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоПартиямПередПроведением(Ссылка, ДополнительныеСвойства);

КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Произведем перерасчет итоговой суммы документа
	ОбработкаСобытийДокументаСервер.ПересчитатьСуммуДокументаПоСебестоимостиСписания(ЭтотОбъект, Отказ,,, ИСТИНА);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование) И (ЭтотОбъект.ДокументОснование.ХозОперация = Справочники.ХозОперации.ЗаказРезервированиеПокупателя
															ИЛИ ЭтотОбъект.ДокументОснование.ХозОперация = Справочники.ХозОперации.РезервированиеПокупателя) Тогда 
															
		// Формирование запроса по табличной части товаров
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                      |	ДокументТовары.Номенклатура КАК Номенклатура,
		                      |	ДокументТовары.Ссылка.ДокументОснование КАК Заказ,
		                      |	ДокументТовары.Ссылка.СкладКомпании КАК СкладКомпании,
		                      |	ДокументТовары.Ссылка.СкладКомпании КАК СкладЗаказа,
		                      |	ДокументТовары.Количество * ДокументТовары.Коэффициент КАК Резерв,
		                      |	ДокументТовары.Количество * ДокументТовары.Коэффициент КАК Заказано,
		                      |	ДокументТовары.Количество * ДокументТовары.Коэффициент КАК Количество,
		                      |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры
		                      |ИЗ
		                      |	Документ.СписаниеТоваров.Товары КАК ДокументТовары
		                      |ГДЕ
		                      |	ДокументТовары.Ссылка = &Ссылка
		                      |	И ДокументТовары.Количество > 0");
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		РезультатЗапросаПоТоварам = Запрос.Выполнить();
		
		 //Снимаем резерв/заказы
		НаборЗаписейЗаказыПокупателей = Движения.ЗаказыПокупателей;
		НаборЗаписейЗаказыПокупателей.РежимПроведения = РежимПроведения;
		НаборЗаписейЗаказыПокупателей.ДокументОбъект = ЭтотОбъект;
		НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
		НаборЗаписейЗаказыПокупателей.Контрагент = ЭтотОбъект.ДокументОснование.Контрагент;
		НаборЗаписейЗаказыПокупателей.Заказ = ЭтотОбъект.ДокументОснование;
		НаборЗаписейЗаказыПокупателей.СкладКомпании = СкладКомпании;
		НаборЗаписейЗаказыПокупателей.Заказывать = Истина;
		НаборЗаписейЗаказыПокупателей.Резервировать = Истина;
		НаборЗаписейЗаказыПокупателей.ПоБазовомуКоличеству=Истина;
		Отказ=НЕ НаборЗаписейЗаказыПокупателей.Расход() ИЛИ Отказ;
		
		// Корректировка резервирования товаров на складе
		НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
		НаборЗаписейОстатки.РежимПроведения=РежимПроведения;
		НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейОстатки.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
		НаборЗаписейОстатки.СкладКомпании=СкладКомпании;
		НаборЗаписейОстатки.Приходовать=Истина;
		НаборЗаписейОстатки.ДвиженияПоРознице=СкладКомпании.Розничный;
		НаборЗаписейОстатки.Резервировать=Истина;
		Отказ=НЕ НаборЗаписейОстатки.Расход() ИЛИ Отказ;
															
	ИначеЕсли ХозОперация=Справочники.ХозОперации.СписаниеТоваров
		ИЛИ ХозОперация=Справочники.ХозОперации.СписаниеВПроизводство Тогда
		// Спишем товар со склада
		РезультатЗапросаПоТоварам = ПолучитьРезультатЗапросаПоТоварам(ЭтотОбъект);
		НаборЗаписейОстатки = Движения.ОстаткиТоваровКомпании;
		НаборЗаписейОстатки.ДокументОбъект            = ЭтотОбъект;
		НаборЗаписейОстатки.СкладКомпании             = СкладКомпании;
		НаборЗаписейОстатки.ДвиженияПоРознице         = СкладКомпании.Розничный;
		НаборЗаписейОстатки.Резервировать             = Истина;
		НаборЗаписейОстатки.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
		
		Отказ= НЕ НаборЗаписейОстатки.Расход() ИЛИ Отказ;
		Если Отказ Тогда
			Возврат; // дальше смысла не имеет
		КонецЕсли;
		
		// Снимаем резервы по заказам (если таковые были)
		НаборЗаписейЗаказыПокупателей = Движения.ЗаказыПокупателей;
		НаборЗаписейЗаказыПокупателей.РежимПроведения = РежимПроведения;
		НаборЗаписейЗаказыПокупателей.ДокументОбъект = ЭтотОбъект;
		НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам = НаборЗаписейОстатки.Выгрузить();
		НаборЗаписейЗаказыПокупателей.СкладКомпании = СкладКомпании;
		Отказ=НЕ НаборЗаписейЗаказыПокупателей.СнятиеРезервовЗаказовПокупателей() ИЛИ Отказ;
	КонецЕсли;
	
	// двигаем границу последовательности заказов
	Если ХозОперация=Справочники.ХозОперации.СписаниеТоваров ИЛИ ХозОперация=Справочники.ХозОперации.СписаниеВПроизводство Тогда 
		РаботаСГраницами.СдвинутьГраницуЗаказов(Ссылка,  ДополнительныеСвойства, Движения);
	КонецЕсли;
	
	// проведем партии товаров
	Отказ = НЕ ПровестиПоПартиям(РежимПроведения,Ссылка) ИЛИ Отказ;
	
	// Возможно расхождение баланса на "копейки" из-за округления. Возникшую разницу
	// необходимо списать на доходы и расходы.
	Отказ = НЕ ОбработкаСобытийДокументаСервер.СписаниеКопейкиПриОкругленииВалютныхСчетов(ЭтотОбъект) ИЛИ Отказ;
	
	// Произведем перерасчет итоговой суммы документа
	ОбработкаСобытийДокументаСервер.ПересчитатьСуммуДокументаПоСебестоимостиСписания(ЭтотОбъект, Отказ, ?(ХозОперация=Справочники.ХозОперации.СписаниеТоваровОтданныхНаКомиссию, "ПартииТоваровОтданные", "ПартииТоваровКомпании"));
	
	Если ПолучитьЗначениеУчетнойПолитики("ПравилоПроверкиХарактеристики",, Дата) = Ложь Тогда
		Возврат;
	КонецЕсли;
	//проставим характеристики в ТЧ документа
	Если НЕ Отказ Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВнешнийИсточник.Номенклатура КАК Номенклатура,
		|	ВнешнийИсточник.ХарактеристикаНоменклатуры КАК Характеристика,
		|	ВнешнийИсточник.Количество КАК Количество
		|ПОМЕСТИТЬ ТаблицаДвижений
		|ИЗ
		|	&ВнешнийИсточник КАК ВнешнийИсточник
		|ГДЕ
		|	ВнешнийИсточник.ХозОперация = &ХозОперация
		|	И ВнешнийИсточник.ХарактеристикаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|	И ВнешнийИсточник.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДвижений.Номенклатура КАК Номенклатура,
		|	ТаблицаДвижений.Характеристика КАК Характеристика,
		|	СУММА(ТаблицаДвижений.Количество) КАК Количество
		|ИЗ
		|	ТаблицаДвижений КАК ТаблицаДвижений
		|ГДЕ
		|	НЕ ТаблицаДвижений.Характеристика В (&Характеристики)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДвижений.Номенклатура,
		|	ТаблицаДвижений.Характеристика
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТаблицаДвижений.Количество) <> 0");
		Запрос.УстановитьПараметр("ВнешнийИсточник", Движения.ПартииТоваровКомпании.Выгрузить());
		Запрос.УстановитьПараметр("ХозОперация", ХозОперация);
		Запрос.УстановитьПараметр("Характеристики", Товары.ВыгрузитьКолонку("ХарактеристикаНоменклатуры"));
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТаблицаДвижений = РезультатЗапроса.Выгрузить();
			СтруктураОтбора = Новый Структура("Номенклатура");
			Для Каждого СтрокаТовар Из Товары Цикл
				Если ЗначениеЗаполнено(СтрокаТовар.ХарактеристикаНоменклатуры) Тогда 
					Продолжить; 
				КонецЕсли;
				//запомним исходные данные
				СуммаСтроки = СтрокаТовар.СуммаРозничная;
				СуммаИтого = 0; 
				СтруктураОтбора.Номенклатура = СтрокаТовар.Номенклатура;
				МассивНайденныхСтрок = ТаблицаДвижений.НайтиСтроки(СтруктураОтбора);
				Если МассивНайденныхСтрок.Количество()=0 Тогда 
					Продолжить; 
				КонецЕсли;
				Для ЭлементМассива=0 По МассивНайденныхСтрок.ВГраница() Цикл
					ТекСтрока = МассивНайденныхСтрок[ЭлементМассива];
					Если ТекСтрока.Количество=NULL ИЛИ ТекСтрока.Количество=0 Тогда 
						Продолжить; 
					КонецЕсли;
					Если СтрокаТовар.Количество>ТекСтрока.Количество Тогда
						//разбиваем строку
						СтрокаТовар.Количество = СтрокаТовар.Количество - ТекСтрока.Количество;
						Документы.СписаниеТоваров.ТоварыКоличествоПриИзменении(ЭтотОбъект, СтрокаТовар);
						
						НоваяСтрока = Товары.Вставить(Товары.Индекс(СтрокаТовар));// + 1 + Сч);
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовар);
						НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрока.Характеристика;
						НоваяСтрока.Количество = ТекСтрока.Количество;
						Документы.СписаниеТоваров.ТоварыКоличествоПриИзменении(ЭтотОбъект, НоваяСтрока);
						НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
						СуммаИтого = СуммаИтого + НоваяСтрока.СуммаРозничная;
						ТаблицаДвижений.Удалить(ТекСтрока);
					Иначе
						СтрокаТовар.ХарактеристикаНоменклатуры = ТекСтрока.Характеристика;
						СуммаИтого = СуммаИтого + СтрокаТовар.СуммаРозничная;
						Если СтрокаТовар.Количество<ТекСтрока.Количество Тогда
							ТекСтрока.Количество = ТекСтрока.Количество - СтрокаТовар.Количество;
						Иначе
							ТаблицаДвижений.Удалить(ТекСтрока);
						КонецЕсли;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				//проверим результат
				РазницаСуммы = СуммаСтроки - СуммаИтого;
				Если РазницаСуммы<>0 ТОгда
					СтрокаТовар.СуммаРозничная = СтрокаТовар.СуммаРозничная + РазницаСуммы;
				КонецЕсли;
			КонецЦикла;
			
			// если модифицировали документ, то запишем его
			Если НЕ Отказ И Модифицированность() Тогда
				ОбменДанными.Загрузка = Истина;
				Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры // ОбработкаПроведения()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли
